# brew tap Homebrew/bundle
# brew bundle
# tap 'homebrew/bundle'

tap 'thoughtbot/formulae'
brew 'rcm'

brew 'mas' # Mac App Store CLI

# TODO: use whalebrew instead of installing deps directly
cask 'docker'

# Productivity
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541

# Communication
mas 'Slack', id: 803453959
cask 'microsoft-teams'
cask 'zoom'
# cask 'keybase'

# Utilities
cask '1password'
cask 'appcleaner'

# Web browsers
cask 'firefox-developer-edition'
cask 'safari-technology-preview'
cask 'microsoft-edge'
# cask 'google-chrome'

# Development
mas 'Xcode', id: 497799835
mas 'Developer', id: 640199958

cask 'visual-studio-code'
# cask 'dash'

brew 'git'
# brew 'git-lfs'
brew 'hub'
cask 'tower'

brew 'elixir'

brew 'node'
# brew 'yarn'

cask 'postman'
cask 'ngrok'

cask 'postgres'
cask 'tableplus'

cask 'imageoptim'
