# brew tap Homebrew/bundle
# brew bundle
# tap 'homebrew/bundle'

# for firefox-developer-edition, safari-technology-preview
tap 'homebrew/cask-versions' 

tap 'thoughtbot/formulae'
brew 'rcm'

brew 'mas' # Mac App Store CLI

# TODO: use whalebrew instead of installing deps directly

cask 'docker'

# Communication
mas 'Slack', id: 803453959
cask 'zoom'
# cask 'keybase'

# Rosetta 2 required
# sudo softwareupdate --install-rosetta
# cask 'microsoft-teams'

# Utilities
cask '1password'

# Web browsers
cask 'microsoft-edge'
cask 'firefox-developer-edition'
cask 'safari-technology-preview'
cask 'google-chrome'

# Development
mas 'Xcode', id: 497799835
mas 'Developer', id: 640199958
mas 'TestFlight', id: 899247664

cask 'visual-studio-code'
cask 'dash'

brew 'git'
# brew 'git-lfs'
brew 'gh'
cask 'tower'

brew 'elixir'

brew 'node'
# brew 'yarn'

brew 'openjdk'

brew 'imagemagick'

cask 'postman'
cask 'ngrok'

cask 'postgres-unofficial'
cask 'tableplus'

cask 'imageoptim'
cask 'prince'

# for Developer Access script
brew 'bash'
brew 'jq'
brew 'dialog'
brew 'fop'
brew 'coreutils'
brew 'curl'
brew 'git'
brew 'awscli'
cask 'session-manager-plugin'



